The only change during upgrade is the group block and results in an update in-place.

This is expected and the exact details vary by the existing deployment.

existing deployment with less then 4G memory: The group memory block will update in-place to 4G of memory.
existing deployment with 4G plus memory: No change.
existing deployment adding host_flavor (as below): The group memory block will update in-place to the flavor chosen.

The upgrade test is safe to skip.

```hcl
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: Terraform used the selected providers to generate the following execution
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: plan. Resource actions are indicated with the following symbols:
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:   ~ update in-place
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:  <= read (data resources)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: Terraform will perform the following actions:
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:   # module.mysql_db.data.ibm_database_connection.database_connection will be read during apply
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:   # (depends on a resource or a module with changes pending)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:  <= data "ibm_database_connection" "database_connection" {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + amqps         = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + analytics     = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + bi_connector  = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + cli           = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + deployment_id = "crn:v1:bluemix:public:databases-for-mysql:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:e717d411-7e0c-4610-a6fc-74287b6e0f74::"
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + emp           = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + endpoint_type = "private"
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + grpc          = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + https         = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + id            = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + mongodb       = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + mqtts         = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + mysql         = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + ops_manager   = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + postgres      = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + rediss        = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + secure        = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + stomp_ssl     = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + user_id       = "admin"
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + user_type     = "database"
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:     }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:   # module.mysql_db.ibm_database.mysql_db will be updated in-place
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:   ~ resource "ibm_database" "mysql_db" {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:         id                        = "crn:v1:bluemix:public:databases-for-mysql:eu-de:a/abac0df06b644a9cabc6e44f55b3880e:e717d411-7e0c-4610-a6fc-74287b6e0f74::"
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:         name                      = "mysql-upg-3kvn09-mysql"
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:         tags                      = []
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:         # (20 unchanged attributes hidden)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       - group {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           - group_id = "member" -> null
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           - cpu {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:               - allocation_count = 0 -> null
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           - disk {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:               - allocation_mb = 10240 -> null
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           - members {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:               - allocation_count = 3 -> null
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           - memory {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:               - allocation_mb = 1024 -> null
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:         }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + group {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           + group_id = "member"
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           + cpu {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:               + allocation_count = 0
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           + disk {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:               + allocation_mb = 10240
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           + host_flavor {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:               + id = "multitenant"
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           + members {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:               + allocation_count = 3
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:           + memory {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:               + allocation_mb = 4096
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:             }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:         }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:         # (3 unchanged blocks hidden)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:     }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:   # module.vpe.data.ibm_is_virtual_endpoint_gateway.vpe["vpe-to-my-vpc-mysql-upg-3kvn09-mysql"] will be read during apply
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:   # (depends on a resource or a module with changes pending)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:  <= data "ibm_is_virtual_endpoint_gateway" "vpe" {
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + access_tags                  = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + allow_dns_resolution_binding = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + created_at                   = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + crn                          = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + health_state                 = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + id                           = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + ips                          = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + lifecycle_state              = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + name                         = "vpe-to-my-vpc-mysql-upg-3kvn09-mysql"
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + resource_group               = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + resource_type                = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + security_groups              = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + service_endpoints            = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + tags                         = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + target                       = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:       + vpc                          = (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:     }
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: Plan: 0 to add, 1 to change, 0 to destroy.
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: 
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: Changes to Outputs:
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:   ~ hostname                   = "e717d411-7e0c-4610-a6fc-74287b6e0f74.b9366f7fcf0b43acb51a70da08153291.private.databases.appdomain.cloud" -> (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185:   ~ port                       = 31238 -> (known after apply)
TestRunUpgradeCompleteExample 2024-06-27T19:20:07Z command.go:185: ╷
```

NOTE: There is a second error in the logs

```hcl
 2024/06/27 19:17:16 Executing: terraform state rm module.mysql_db.time_sleep.wait_for_authorization_policy
TestRunFSCloudExample 2024-06-27T19:17:16Z tests.go:336: ╷
│ Error: Invalid target address
│ 
│ No matching objects found. To view the available instances, use "terraform
│ state list". Please modify the address to reference a specific instance.
╵
```

This is an unrelated issue and will be addressed by #93